{
  "versions": [
    {
      "version": "0.4.6",
      "date": "2026-01-28",
      "type": "patch",

      "breakingChanges": [],

      "improvements": [
        "README completely rewritten for npm onboarding clarity and first-run success",
        "Replaced vague LIMITED mode terminology with clear source-not-detected behavior explanation",
        "Added explicit prerequisites before own-site usage instructions",
        "Provided concrete example artifact paths and runIds (e.g., 20260128-143052-run-abc123)",
        "Fixed broken URL example (https://your-site.test → http://localhost:3000)",
        "Added operational clarity to INCOMPLETE exit code with table of causes and fixes",
        "Added clarity to SUCCESS exit code with explicit does NOT mean sections",
        "Defined Partial framework support operationally with test recommendations",
        "Added verax doctor diagnostics to source-not-detected troubleshooting",
        "All examples now realistic and immediately actionable for first-time users"
      ],

      "fixes": [
        "Removed placeholder paths like <id> and <runId>; all paths now concrete",
        "Removed nested-terminology contradictions (LIMITED mode vs evidence-backed safety)",
        "Clarified that source detection looks for specific file types (.js, .jsx, .tsx, .html)",
        "Clarified that INCOMPLETE is not a reduced-functionality mode but a hard blocker"
      ],

      "guarantees": [
        "CLI commands and exit codes remain stable (0/10/20/30/40/50/64)",
        "Artifact schemas unchanged: summary.json, findings.json, observe.json",
        "Deterministic, read-only, zero-config behavior preserved"
      ],

      "notes": "Documentation-only release. No code changes, artifact schema changes, or breaking changes. Safe for production upgrades."
    },
    {
      "version": "0.4.5",
      "date": "2026-01-27",
      "type": "patch",

      "breakingChanges": [],

      "improvements": [
        "Deterministic silent failure detection for public pre-auth user flows",
        "Zero-config source auto-discovery with safety-first LIMITED mode",
        "Evidence-backed findings with screenshots, DOM diffs, and traces",
        "Strict and documented CLI exit code contract (0, 20, 30, 50, 64)",
        "Doctor command hardened for clean npm installations",
        "Improved CI/CD gating semantics with conservative INCOMPLETE handling"
      ],

      "fixes": [
        "Fixed doctor command crashing when Playwright devDependencies are missing",
        "Fixed runtime dependency declaration for YAML policy parsing",
        "Fixed false-positive risk by enforcing evidence-law at detect phase",
        "Fixed inconsistent coverage signaling on first run",
        "Fixed public CLI surface to match documentation exactly"
      ],

      "guarantees": [
        "Read-only operation: VERAX never modifies user code or environment",
        "Deterministic execution: identical inputs produce identical normalized outputs",
        "No silent success: uncertain results are always marked INCOMPLETE",
        "No findings without evidence: all findings include observable proof",
        "Public pre-auth scope enforced by design and code"
      ],

      "notes": "This is the first public, production-ready release of VERAX. The release is fully audited, vision-compliant, and validated across 856 passing tests with zero failures."
    }
  ]
}
